LEXICON_RU: dict[str, str] = {
    "start": "\U0001F44B Приветствую!\nЯ могу вам помочь распланировать любое путешествие.\
        \nДалее необходимо ввести свои данные, чтобы заполнить профиль:\
        \nСколько вам лет?",
    "help": "\U0001F916 Я могу вам помочь распланировать любое путешествие: не потерять важные документы, построить маршрут, найти новых друзей, поделить расходы, увидеть достопримечательности и узнать прогноз погоды на протяжении маршрута.\
        \n\n\U0001F4A1 Для начала необходимо пройти небольшую процедуру регистрации /start . После этого вы сможете воспользоваться основным функционалом бота /menu",
    "menu": "\U0001F9F3	Главное меню бота",
    "set_sex": "\U0001F464 Укажите ваш пол",
    "set_location": "\U0001F310 Теперь установим ваше местоположение",
    "set_currency": "\U0001F4B0 Выберите вашу валюту",
    "set_bio": "\U0001F4CB На данном этапе вы можете рассказать о себе, либо оставить это поле пустым",
    "settings_done": "\U00002699 Настройка профиля завершена! Теперь вы можете с легкостью планировать свои поездки. Вот основное меню бота",
    "edit_profile": "\U0001F4C5 Отредактируйте ваш возраст",
    "edit_sex": "\U0001F464 Отредактируйте ваш пол",
    "edit_location": "\U0001F310 Теперь отредактируем ваше местоположение",
    "edit_currency": "\U0001F4B0 Отредактируйте вашу валюту",
    "edit_bio": '\U0001F4CB Отредактируйте раздел "О себе"',
    "my_trips": "\U0001F5FA Ваши путешествия",
    "new_trip": "\U0001F3F7 Для начала придумайте название для вашего путешествия",
    "trip_description": "\U0001F4CB Теперь вы можете ввести краткое описание, либо оставить это поле пустым",
    "trip_destination": "\U0001F310 Чтобы установить первую точку маршрута используйте встроенную в Telegram функцию отправки местоположения",
    "trip_dates": "\U0001F4C5 Введите сроки пребывания в этом месте в формате:\nДД.ММ.ГГГГ-ДД.ММ.ГГГГ",
    "trip_created": "\U0001F3D4 Путешествие создано! Теперь вы можете его дополнять и редактировать в разделе ниже",
    "edit_trip": "\U0001F3F7 Отредактируйте название путешествия",
    "edit_description": "\U0001F4CB Отредактируйте краткое описание путешествия",
    "editing_done": "\U0000270F Редактирование завершено!",
    "confirm_deletion": "\U0001F628 Вы уверены, что хотите удалить?",
    "deletion_done": "\U0001F5D1 Удаление завершено!",
    "deletion_canceled": "\U0001F60C Удаление отменено",
    "my_notes": "\U0001F4D3 Ваши заметки",
    "new_note": "\U0001F510 Перед созданием заметки выберите, будет ли она видна для других участников путешествия",
    "upload_file": "\U0001F4C1 Вы можете прикреплять файлы размером до 20 Мб, одна загрузка - один файл",
    "uploading_done": "\U0001F4C1 Загрузка файла завершена!",
    "friends": "\U0001F465 Друзья, участвующие в поездке",
    "add_friend": "\U0001F465 Чтобы пригласить друга в путешествие введите его ник в формате @example",
    "friend_addition_done": "\U0001F465 Пользователь добавлен!",
    "found_friends": "\U0001F50E Я выполнил поиск по вашему возрасту и интересами, вот кого я нашел",
    "locations": "\U0001F9ED Локации",
    "new_location": "\U0001F310 Чтобы добавить новую точку маршрута используйте встроенную в Telegram функцию отправки местоположения",
    "location_addded": "\U0001F9ED Локация добавлена",
    "location_dates": "\U0001F4C5 Теперь введите сроки пребывания в этом месте в формате:\nДД.ММ.ГГГГ-ДД.ММ.ГГГГ",
    "route": "\U0001F310 Маршрут путешествия",
    "wait": "\U000023F3 Немного подождите, идет построение маршрута...",
    "weather_limitations": "\U0001F4A1 Прогноз может содержать не все дни, так как он доступен лишь на 16 дней вперед",
    "landmarks_limitations": "\U0001F4A1 В маленьких городах количество достопримечательностей может быть меньше 10",
    "select_currency": "\U0001FA99 Выберите, во что будем конвертировать вашу валюту",
    "enter_amount": "\U0001F4B0 Введите количество",
    "expenses": "\U0001F4B3 Вот все неразделенные траты",
    "new_expense": "\U0001F3F7 Введите название траты",
    "new_debtor": "\U0001F464 Введите имя пользователя нового должника в формате @example",
    "debtor_added": "\U0001F464 Должник добавлен!",
    "expense_cost": "\U0001F9FE Введите сумму, которую вы заплатили в своей валюте",
    "expense_debtors": "\U0001F465 Теперь из списка участников путешествия выпишите должников в формате:\n@example, @example, @example",
    "expense_added": "\U0001F4B8 Траты записаны!",
    "edit_expense": "\U0001F3F7 Отредактируйте название траты",
    "edit_cost": "\U0001F9FE Отредактируйте сумму, которую вы заплатили в своей валюте",
    "confirm_write_off": "\U0001F911 Подтвердите возврат долга",
    "write_off_done": "\U0001F4B0 Долг возвращен!",
    "write_off_done_closed": "\U0001F4B0 Долг возвращен и трата закрыта!",
    "write_off_canceled": "\U0001F4B0 Возврат долга отменен",
    "play_game": "\U0001F608 Предлагаю сыграть в игру: случайным образом будет выбран должник, на которого спишутся все долги остальных людей. Сыграем?",
    "game_loser": "Теперь он/она оплачивает все долги",
    "unknown": "\U0001F6AB Извините, к сожалению, я вас не понимаю.\
                \nЕсли вы что-то настраиваете, то следуйте командам и вводите корректные данные",
}


KB_LEXICON_RU: dict[str, str] = {
    "male": "\U0001F468 М",
    "female": "\U0001F469 Ж",
    "set_location": "\U0001F4CD Установить местоположение",
    "leave_blank": "\U0001F4CB Сделать пустым",
    "leave_same": "\U0001F4DD Не редактировать",
    "my_trips": "\U0001F5FA Мои путешествия",
    "new_trip": "\U0001F9ED Новое путешествие",
    "edit": "\U0000270F	Редактировать",
    "friends": "\U0001F465 Друзья",
    "locations": "\U0001F9ED Локации",
    "route": "\U0001F9ED Маршрут",
    "weather": "\U0001F324 Погода",
    "notes": "\U0001F4D3 Заметки",
    "landmarks": "\U0001F5FD Достопримечательности",
    "currency": "\U0001F4B1 Конвертер валют",
    "expenses": "\U0001F9FE Траты",
    "delete": "\U0000274C Удалить",
    "cancel_deletion": "\U00002B55 Не удалять",
    "new_note": "\U0001F4D3 Новая заметка",
    "private_note": "\U0001F512 Закрытая",
    "unprivate_note": "\U0001F513 Открытая",
    "back_to_trip": "\U0001F519 К путешествию",
    "back_to_notes": "\U0001F519 К заметкам",
    "add_friend": "\U0001F4DD Добавить друга",
    "find_friends": "\U0001F50E Найти друзей",
    "add_user": "\U00002709 Пригласить в путешествие",
    "back_to_found_users": "\U0001F519 В раздел поиска друзей",
    "back_to_friends": "\U0001F519 В раздел друзей",
    "new_location": "\U0001F310 Новая локация",
    "back_to_locations": "\U0001F519 В локации",
    "back_to_location": "\U0001F519 К локации",
    "new_expense": "\U0001F4B3 Новые траты",
    "new_expense_debtor": "\U0001F464 Добавить должника",
    "back_to_expenses": "\U0001F519 К тратам",
    "back_to_expense": "\U0001F519 К тратe",
    "write_off_debt": "\U0001F4B8 Возврат долга",
    "write_off": "\U0000274C Вернуть",
    "cancel_write_off": "\U00002B55 Не возвращать",
    "expense_game": "\U0001F3B2 Кто за всех платит",
    "play": "\U0001F3B2 Сыграть",
}


LEXICON_COMMANDS_RU: dict[str, str] = {
    "/menu": "\U0001F5C2 Главное меню",
    "/profile": "\U0001F464 Ваш профиль",
    "/help": "\U0001F916 О боте",
}


ERROR_LEXICON_RU: dict[str, str] = {
    "no_profile": "\U000026A0 Вашего профиля пока что не существует, пройдите процедуру регистрации /start",
    "no_username": "\U000026A0 Для корректной работы бота необходимо указать имя пользователя в формате @example в настройках Telegram аккаунта, установите его и повторите попытку /start",
    "incorrect_data": "\U0001F6AB <b>Произошла ошибка!</b>\
       \nПроверьте корректность введенных данных и повторите попытку",
    "incorrect_file": "\U0001F6AB <b>Произошла ошибка!</b>\
       \nФайл данного типа не поддерживается, либо он слишком большой",
    "cant_add_yourself": "\U000026A0 Вы уже участвуете в этом путешествии",
    "InternalError": "\U0001F6AB <b>Произошла ошибка!</b>\
       \nПроизошла внутренняя ошибка, повторите попытку позже",
    "DatabaseError": "\U0001F6AB <b>Произошла ошибка!</b>\
       \nВозникла ошибка во время работы с базой данных, повторите попытку позже",
    "UserNotFoundError": "\U0001F6AB <b>Произошла ошибка!</b>\
       \nПользователь с таким ником не зарегистрирован в системе, проверьте корректность введенных данных и повторите попытку",
    "UserNotInTripError": "\U0001F6AB <b>Произошла ошибка!</b>\
       \nПользователь с таким ником не участвует в данном путешествии, проверьте корректность введенных данных и повторите попытку",
    "UserInListNotFoundError": "\U0001F6AB <b>Произошла ошибка!</b>\
       \nОдин из пользователей не зарегистрирован в системе, проверьте корректность введенных данных и повторите попытку",
    "GeocodingError": "\U0001F6AB <b>Произошла ошибка!</b>\
        \nВозникла ошибка во время определения местоположения, повторите попытку позже",
    "LocationExistsError": "\U0001F6AB <b>Произошла ошибка!</b>\
        \nДанная локация уже есть в списке, добавьте другую",
    "InvalidDateError": "\U0001F6AB <b>Произошла ошибка!</b>\
        \nСроки пребывания в локациях не должны пересекаться",
    "NavigationError": "\U0001F6AB <b>Произошла ошибка!</b>\
        \nВозникла ошибка при построении маршрута, вероятно, он слишком длинный, максимальная длина маршрута - 6000 км",
    "IsStartPointError": "\U0001F6AB <b>Произошла ошибка!</b>\
        \nДанная точка совпадает с начальной точкой маршрута",
    "NoLocationsError": "\U0001F6AB <b>Произошла ошибка!</b>\
        \nЧтобы построить маршрут необходимо указать хотя бы одну локацию в путешествии",
    "WeatherDateError": "\U000026A0 Прогноз погоды доступен только на 16 дней вперед",
    "ServiceConnectionError": "\U0001F6AB <b>Произошла ошибка!</b>\
        \nВозникла ошибка при работе со сторонним сервисом, повторите попытку позже",
}
